Revit 2027 API
LinkLoadResult.GetCentralModelName Method
 Gets the central model's name. If the link is not workshared, this returns an empty FilePath. If the link is itself a central model, this returns the link's name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ModelPath GetCentralModelName()
Public Function GetCentralModelName As ModelPath
public:
ModelPath^ GetCentralModelName()
member GetCentralModelName : unit -> ModelPath
Return Value
ModelPath
Remarks
 If the link could not be found or loaded, this name may be blank. This function is only relevant for LinkLoadResult object for RvtLinkSymbol. ie. when getIsRvtLink() is true.
See Also
Reference
LinkLoadResult Class
Autodesk.Revit.DB Namespace